lofar-data.org
#+title: Radio Data
#+STARTUP: overview

* LINC

The software for processing LOFAR data.

Pipeline documents: [[https://linc.readthedocs.io/en/latest/]]
LOFAR LTA: https://lta.lofar.eu

** Installation

LINC is the pipeline for processing LOFAR data.

Download LINC workflow files or use the already downloaded files on ALICE.
~git clone https://git.astron.nl/RD/LiNC.git <install dir>~
~/data/grbemission/shared/LINC/~

Next, obtaining Singularity container containing all the actual pipeline scripts. (Singularity is now called apptainer but runs effectively the same)

Installing apptainer isn't reqiured on Leicester HPC, as it's already a provided module. You don't need to load this before running the pipeline as this command can be included in the job submission script.
~module load apptainer~

There are two methods of running LINC - you can run cwltool which fetches the container as part of the pipeline, or get the container first and run cwltool within it. I've had more success with the latter option. In this case, cwltool is part of the container so no additional installation is required. If you'd like to try the other way, no neeed to pull the container manually, and installing cwltool is a simple pip install. The running commands are slightly different so check the LINC documents.

Pull the container from Astron or use the container already stored on ALICE.
~apptainer pull docker://astronrd/linc~
~/data/grbemission/shared/linc_latest.sif~

** Downloading data

You will first need to have an account on LOFAR LTA - inquire with Antonia or just email the LTA team yourself (if I remember correctly they'll have to contact Rhaana or Antonia anyway as PI's to add you to the unpublic projects).

Once this is done, you can go to the website > browse projects and select the cycle, and then the specific project you're interested in. Select show data > averaging pipeline to access the datasets. The names aren't so descriptive at this point, but you can usually easily identify the calibrator and target measurements. For the case of GRBs, you can select 'All Dataproducts' and look under 'Start Time' to get the date and hence identify which GRB it is.

Once you know what data you want, click the top checkbox to select all datasets and then click 'stage selected' (top centre above table). You'll get a confirmation with filesize - click submit. You'll get an email confirming the data is queued which can take some hours to send. The data has to be moved from tape to disk so this step, depending on other user activity and data amount, can take some hours to a few days. Once the data is ready, you'll recieve an email.

Within the email there will be a .txt file, a list of paths to each measurement set that'll you'll download, copy the (contents) of the file to a .txt file in ALICE, where you want the data to be downloaded to. Before downloading you'll need to add credentials so the LTA knows it's you when you start requesting the files.

Create a file at ~~/.wgetrc~ and add to it, filling in your LTA details:
#+BEGIN_SRC bash
username=<lta_username>
password=<lta_password>
#+END_SRC

Now you are ready to download. The bottleneck is usually somewhere on ASTRON's end, but can just be UOL's wifi being busy, so this stage can take a fair amount of time. This can cause issues with sessions timing out if you do this through SSH. You could submit a long job request with low memory, but this can take time just for the job to actually start. Instead I prefer to use NoMachine (look at ALICE document pages for installation help) because these sessions don't time out for 3 days.

Open two terminals, one for calibrator and target, and open each to the directory in scratch where you want to download the respective data to. Then download:
~wget -ci lta_file.txt~

The c flag means that it'll carry on and resume from where it stopped in the case the download process is halted, the i flag just means it'll download files from the list within the .txt file. If you get 401 Authorization errors (more than once) then your LTA credentials aren't working.

*** Preparing data

Once done, the downloaded sets will be .tar files with long names. There is an ASTRON provided script to unzip and clean this up.
~python /data/grbemission/shared/linc_files/scripts/cleanupfiles.py .~

Run this when you're in the directory with the tar files and it'll clean this up to just include the observation code and measurement number.

** Running

With the data downloaded, you're ready to run the pipeline. The general outline at least for GRBs is to run the calibration pipeline on the calibrator data, take the output solutions and run the target pipeline on the target data with these solutions.

First create an input JSON file pointing towards all the measurement sets. At this stage you can include additional pipeline options as part of this file, details can be found in the documentation, but for a simple run nothing else is reqiured. There's another script provided that can do this automatically, unless you fancy manually typing out 244 filepaths.

I usually run this from the base directory for that specific projects, i.e. if I'm in /scratch/grbemission/ah724/GRBXXXXXXA, I set <directory> to /uncalibrated_data/calib - change as you prefer, just be aware that this path needs to correct relative to where you run the pipeline job from.

I also send the output straight into a json file, and then remove the couple of output lines the script prints.
#+BEGIN_SRC bash
python /data/grbemission/shared/linc_files/scripts/GetMSlist.py <directory> > input_calibrator.json

# the output into the piped will produce something similar to:
{
    "msin": [
        {"class": "Directory", "path": "/path/to/data_01.MS"},
        {"class": "Directory", 'path": "/path/to/data_02.MS"},
        ...
    ]
}
#+END_SRC

If you haven't separated the calib and target datasets into separate directories, that's ok, just be sure to include a wildcard selecting only the correct ones when you add <directory>. The first run should just be calibrator data.

