lofar-data.md

# Table of Contents

1.  [LINC](#orgbc030c9)
    1.  [Installation](#org8edf2b4)
    2.  [Downloading data](#org08c49a2)
        1.  [Preparing data](#orgaa2f5fd)
    3.  [Running](#org68023ab)
        1.  [Running LINC pipeline](#org937c01a)
        2.  [Debugging](#org7fb553d)
    4.  [POSSIBLE ISSUES](#org95eb8a5)
        1.  [Failing on download<sub>target</sub><sub>skymodel</sub>](#org681e750)
        2.  [Wrong download URL](#org50e55f8)
        3.  [A different wrong download URL?](#org9841ae1)
        4.  [Failing on target/structure<sub>function</sub>](#org2f6dfcc)
2.  [WSClean](#orgb9cb10a)
    1.  [Basic Imaging Command](#orgaf20307)
    2.  [msoverview](#org046d023)
    3.  [Output](#orgd9e1706)
3.  [Struis](#org7bb6405)
4.  [TRAP](#org47bdbaf)
    1.  [Installation &#x2013; for tkp4.0 / python2.7 version](#org4bece41)
        1.  [change commands to conda create env commands](#orgca511e1)
    2.  [Setting up TRAP](#orga752610)
        1.  [TKP PostgreSQL Login Details](#org484eb3a)
    3.  [Using TRAP](#org7e8b5c7)
5.  [PostgreSQL](#orgab5f20e)
    1.  [Deleting databases](#org86ed596)
6.  [Banana](#org817871b)



<a id="orgbc030c9"></a>

# LINC

The software for processing LOFAR data.

Pipeline documents: <https://linc.readthedocs.io/en/latest/>
LOFAR LTA: <https://lta.lofar.eu>


<a id="org8edf2b4"></a>

## Installation

LINC is the pipeline for processing LOFAR data.

Download LINC workflow files or use the already downloaded files on ALICE.
`git clone https://git.astron.nl/RD/LiNC.git <install dir>`
`/data/grbemission/shared/LINC/`

Next, obtaining Singularity container containing all the actual pipeline scripts. (Singularity is now called apptainer but runs effectively the same)

Installing apptainer isn&rsquo;t reqiured on Leicester HPC, as it&rsquo;s already a provided module. You don&rsquo;t need to load this before running the pipeline as this command can be included in the job submission script.
`module load apptainer`

There are two methods of running LINC - you can run cwltool which fetches the container as part of the pipeline, or get the container first and run cwltool within it. I&rsquo;ve had more success with the latter option. In this case, cwltool is part of the container so no additional installation is required. If you&rsquo;d like to try the other way, no neeed to pull the container manually, and installing cwltool is a simple pip install. The running commands are slightly different so check the LINC documents.

Pull the container from Astron or use the container already stored on ALICE.
`apptainer pull docker://astronrd/linc`
`/data/grbemission/shared/linc_latest.sif`


<a id="org08c49a2"></a>

## Downloading data

You will first need to have an account on LOFAR LTA - inquire with Antonia or just email the LTA team yourself (if I remember correctly they&rsquo;ll have to contact Rhaana or Antonia anyway as PI&rsquo;s to add you to the unpublic projects).

Once this is done, you can go to the website > browse projects and select the cycle, and then the specific project you&rsquo;re interested in. Select show data > averaging pipeline to access the datasets. The names aren&rsquo;t so descriptive at this point, but you can usually easily identify the calibrator and target measurements. For the case of GRBs, you can select &rsquo;All Dataproducts&rsquo; and look under &rsquo;Start Time&rsquo; to get the date and hence identify which GRB it is.

Once you know what data you want, click the top checkbox to select all datasets and then click &rsquo;stage selected&rsquo; (top centre above table). You&rsquo;ll get a confirmation with filesize - click submit. You&rsquo;ll get an email confirming the data is queued which can take some hours to send. The data has to be moved from tape to disk so this step, depending on other user activity and data amount, can take some hours to a few days. Once the data is ready, you&rsquo;ll recieve an email.

Within the email there will be a .txt file, a list of paths to each measurement set that&rsquo;ll you&rsquo;ll download, copy the (contents) of the file to a .txt file in ALICE, where you want the data to be downloaded to. Before downloading you&rsquo;ll need to add credentials so the LTA knows it&rsquo;s you when you start requesting the files.

Create a file at `~/.wgetrc` and add to it, filling in your LTA details:

    username=<lta_username>
    password=<lta_password>

Now you are ready to download. The bottleneck is usually somewhere on ASTRON&rsquo;s end, but can just be UOL&rsquo;s wifi being busy, so this stage can take a fair amount of time. This can cause issues with sessions timing out if you do this through SSH. You could submit a long job request with low memory, but this can take time just for the job to actually start. Instead I prefer to use NoMachine (look at ALICE document pages for installation help) because these sessions don&rsquo;t time out for 3 days.

Open two terminals, one for calibrator and target, and open each to the directory in scratch where you want to download the respective data to. Then download:
`wget -ci lta_file.txt`

The c flag means that it&rsquo;ll carry on and resume from where it stopped in the case the download process is halted, the i flag just means it&rsquo;ll download files from the list within the .txt file. If you get 401 Authorization errors (more than once) then your LTA credentials aren&rsquo;t working.


<a id="orgaa2f5fd"></a>

### Preparing data

Once done, the downloaded sets will be .tar files with long names. There is an ASTRON provided script to unzip and clean this up.
`python /data/grbemission/shared/linc_files/scripts/cleanupfiles.py .`

Run this when you&rsquo;re in the directory with the tar files and it&rsquo;ll clean this up to just include the observation code and measurement number.


<a id="org68023ab"></a>

## Running

With the data downloaded, you&rsquo;re ready to run the pipeline. The general outline at least for GRBs is to run the calibration pipeline on the calibrator data, take the output solutions and run the target pipeline on the target data with these solutions.

First create an input JSON file pointing towards all the measurement sets. At this stage you can include additional pipeline options as part of this file, details can be found in the documentation, but for a simple run nothing else is reqiured. There&rsquo;s another script provided that can do this automatically, unless you fancy manually typing out 244 filepaths.

I usually run this from the base directory for that specific projects, i.e. if I&rsquo;m in /scratch/grbemission/ah724/GRBXXXXXXA, I set <directory> to /uncalibrated<sub>data</sub>/calib - change as you prefer, just be aware that this path needs to correct relative to where you run the pipeline job from.

I also send the output straight into a json file, and then remove the couple of output lines the script prints.

    python /data/grbemission/shared/linc_files/scripts/GetMSlist.py <directory> > input_calibrator.json
    
    # the output into the piped will produce something similar to:
    {
        "msin": [
            {"class": "Directory", "path": "/path/to/data_01.MS"},
            {"class": "Directory", 'path": "/path/to/data_02.MS"},
            ...
        ]
    }

If you haven&rsquo;t separated the calib and target datasets into separate directories, that&rsquo;s ok, just be sure to include a wildcard selecting only the correct ones when you add <directory>. The first run should just be calibrator data.
