lofar-data.org
*** Running LINC pipeline

An example command to run LINC is included, and then below a more full example of submitting the job to ALICE.

#+BEGIN_src bash
apptainer exec --bind /scratch:/scratch
<path/to/container.sif>
cwltool \
--outdir /path/to/cwd/outdir/ \
--logdir /path/to/cwd/logdir/ \
--preserve-entire-environment \
--parallel \
--no-container \
~/data/grbemission/shared/linc_latest.sif~
<path_to_cwl_files>/workflows/HBA_calibrator.cwl \
<input.json>
#+END_src

Assuming this is run from the project base directory, then input.json is also stored here pointing /uncalibrated_data/calib in my case. 'outdir' is the directory to save the finished diagnostic plots and solutions (e.g. ~/calibration_pipeline/outdir/~), 'logdir' contains all the logs for each step of the pipeline (e.g. ~/calibration_pipeline/logdir/~), and the other commands are for running within the singularity container. 'parallel' allows for parallel processes to happen and significantly speeds up the pipeline.

<path_to_container.sif> is the path to the container, either where you installed it or using the shared location:  ~/data/grbemission/shared/linc_latest.sif~
<path_to_cwl_files> is the path to your downloaded workflow files, alternatively if you're using the ones stored in ALICE already then set this to: ~/data/grbemission/shared/LINC/~.
<input.json> is simply the name of your JSON file.

Be sure to include the bind statement otherwise apptainer can't access scratch and the pipeline will fail.

Depending on the size of the data files and speed of processing, each pipeline can take 3-7 hours for GRBs, closer to 7 if using debugging options (see LINC documentation).

When running on ALICE by default a whole process log file is created automatically.

**** Full Leicester submission script

A full example script is included below. Change the job name, memory, time, mail and account as required. I prefer to define the LINC and work directories above just so I can change thees a bit easier when I run on different datasets.

#+BEGIN_src bash
#!/bin/bash

#SBATCH --job_name=cal_200416a
#SBATCH --nodes=1
#SBATCH --cpus-per-task=16
#SBATCH --mem=128gb
#SBATCH --time=08:00:00
#SBATCH --mail-type=BEGIN,END,FAIL
#SBATCH --mail-user=ah724@leicester.ac.uk
#SBATCH --export=Non
#SBATCH --account=grbemission

module load apptainer

export OMP_NUM_THREADS=$SLURM_CPUS_PER_TASK
export LINC_DIR=/data/grbemission/shared/LINC
export WORK_DIR=/scratch/grbemission/ah724/LOFAR_Followup/GRB200416A
cd $WORK_DIR

apptainer exec --bind /scratch:/scratch \
    $LINC_DIR/linc_latest.sif \
    cwltool \
        --outdir "/calibration_pipeline/outdir" \
        --logdir "/calibration_pipeline/logdir" \
        --preserve-entire-environment \
        --parallel \
        --no-container \
        $LINC_DIR/workflows/HBA_calibrator.cwl \
        input_calib.json
#+END_src



**** Target pipeline
The process is mostly the same. The JSON file now needs to give a list of the target files. In the submission script, ~HBA_calibrator.cwl~ should now be ~HBA_target.cwl~.
When you create the target JSON file, you will also need to add a line to point the pipeline to the calibration solutions, as such:

#+BEGIN_EXAMPLE
{
    "msin": [
        {"class": "Directory", "path": "/path/to/data_01.MS"},
        {"class": "Directory", 'path": "/path/to/data_02.MS"},
        ...
        ],
    "cal_solutions": {"class": "File", "path": "calibration_pipeline/outdir/cal_solutions.h5"}
}
#+END_EXAMPLE


*** Debugging

Include these options for debugging.
#+BEGIN_src bash
--debug
--tmpdir-prefix /path/to/cwd/tempdir/
--preserve-entire-environment
--leave-tmpdir
#+END_src

** POSSIBLE ISSUES

Just things that came up as potential issues for me. These may just be user error, specific problems with the datasets, or things that have since been fixed by ASTRON. Most common error will be the structure_function issue.

*** Failing on download_target_skymodel
*** Wrong download URL
Edit $LINCDIR/scripts/download_skymodel_target.py
Line 120 - change URL ~gsmv4~ to ~gsmv5~
*** A different wrong download URL?
Finds an error 302 on normal URL with cgi, then tries and fails on same URL but acgi.
Checking the python files I can't find any reference to acgi - it should just true cgi x5 then fail if this isn't valid but instead tries cgi then acgi 5 times.
In this case, just follow the actual URL to the page. Create file target.skymodel somewhere in the directory, and add to target.json:
~"target_skymodel": {"class": "File", "path": "/path/to/target.skymodel"}~

*** Failing on target/structure_function
Usually due to flagged data making some or all bands band, or totally deleted.
To .json add ~'make_structure_function': false~


* WSClean

Software is included in the LINC Singularity container - this needs to be active to run WSClean.

** Basic Imaging Command

#+BEGIN_src bash
wsclean \
-mgain 0.8 \           # Cleaning parameters.
-auto-mask 10 \
-pol I \
-maxuv-l 8000 \
-auto-threshold 3 \
-weight briggs -0.5 \
-niter 100000 \
-weighting-rank-filter 3.0 \
-fit-beam \
-reorder \
-clean-border 0 \
-apply-primary-beam \
-join-channels \
-no-update-model-required \
-name <name> \        # User parameters.
-channels-out 6 \
-size 2048 2048 \
-scale 1asec \
*.ms | tee imaging.log
#+END_src

Timeslicing
#+BEGIN_SRC bash
-reorder --> -no-reorder
-intervals-out X            # Split observation into X chunks.
-interval A B               # Only use slices A to B of the whole dataset, splitting it into X chunks.
#+END_src

** msoverview

~msoverview in=file.ms (verbose=T)~
View detailed information about the measurement sets. I believe this command is part of CASA, or in the Singularity container.

** Output
Produces primary beam images, dirty, model, individual beam visibilities for each outputted timeslice and per frequency channel requested.

*-image-pb.fits are the files most interesting to us.

Example Recent Run
#+BEGIN_src bash
wsclean \
-mgain 0.8 \
-auto-mask 10 \
-pol I \
-maxuv-l 8000 \
-auto-threshold 3 \
-weight-briggs -0.5 \
-niter 100000 \
-weighting-rank-filter 3.0 \
-clean-border 0 \
-fit-beam \
-apply-primary-beam \
-channel-division-frequencies 1.37e8,1.6e8 \
-channels-out 1
-reorder \
-update-model-required \
-name midf_wholetime_noslice \
-size 2048 2048
-scale 1asec \
*.ms
#+END_src


* Struis

Struis - Amsterdam HPC system. You'll need to acquire login details for this.
~ssh <username>@struis.science.uva.nl~

[[file:login-info.org::* Struis SSH][Login details]]


* TRAP

Software for analysing LOFAR data.

For Python3 - setup is easier (I've saved the word to Documents somewhere but requires asking antonia for a python3 database I believe)

** Installation -- for tkp4.0 / python2.7 version

Clone latest version from Github.
~git clone https://github.com/transientskp/tkp.git~

Create a virtualenv if you don't already have one and source it. TraP 5.0 runs on Python2 still so ensure virtualenv is setup accordingly.
#+begin_src zsh
virtualenv trap_env_2023 --python=python2.7


conda activate
#+end_src

Install Jupyter notebook.
#+begin_src bash
pip install --upgrade pip
pip install notebook
#+end_src

Install boost
#+begin_src bash
conda install -c conda-forge boost
#+end_src

*Changing TraP version*
Install tkp with developer mode with the '-e' tag, meaning we can use the Git checkout feature.
#+begin_src zsh
cd ~/tkp
pip install -e ".[pixelstore]"
git tag             # Shows all available tags.
git checkout r5.0   # 5.0 is the python 2.7 version I think current banana uses
#+end_src

