lofar-data.md


<a id="org937c01a"></a>

### Running LINC pipeline

An example command to run LINC is included, and then below a more full example of submitting the job to ALICE.

    apptainer exec --bind /scratch:/scratch
    <path/to/container.sif>
    cwltool \
    --outdir /path/to/cwd/outdir/ \
    --logdir /path/to/cwd/logdir/ \
    --preserve-entire-environment \
    --parallel \
    --no-container \
    ~/data/grbemission/shared/linc_latest.sif~
    <path_to_cwl_files>/workflows/HBA_calibrator.cwl \
    <input.json>

Assuming this is run from the project base directory, then input.json is also stored here pointing /uncalibrated<sub>data</sub>/calib in my case. &rsquo;outdir&rsquo; is the directory to save the finished diagnostic plots and solutions (e.g. `/calibration_pipeline/outdir/`), &rsquo;logdir&rsquo; contains all the logs for each step of the pipeline (e.g. `/calibration_pipeline/logdir/`), and the other commands are for running within the singularity container. &rsquo;parallel&rsquo; allows for parallel processes to happen and significantly speeds up the pipeline.

<path<sub>to</sub><sub>container.sif</sub>> is the path to the container, either where you installed it or using the shared location:  `/data/grbemission/shared/linc_latest.sif`
<path<sub>to</sub><sub>cwl</sub><sub>files</sub>> is the path to your downloaded workflow files, alternatively if you&rsquo;re using the ones stored in ALICE already then set this to: `/data/grbemission/shared/LINC/`.
<input.json> is simply the name of your JSON file.

Be sure to include the bind statement otherwise apptainer can&rsquo;t access scratch and the pipeline will fail.

Depending on the size of the data files and speed of processing, each pipeline can take 3-7 hours for GRBs, closer to 7 if using debugging options (see LINC documentation).

When running on ALICE by default a whole process log file is created automatically.

1.  Full Leicester submission script

    A full example script is included below. Change the job name, memory, time, mail and account as required. I prefer to define the LINC and work directories above just so I can change thees a bit easier when I run on different datasets.
    
        #!/bin/bash
        
        #SBATCH --job_name=cal_200416a
        #SBATCH --nodes=1
        #SBATCH --cpus-per-task=16
        #SBATCH --mem=128gb
        #SBATCH --time=08:00:00
        #SBATCH --mail-type=BEGIN,END,FAIL
        #SBATCH --mail-user=ah724@leicester.ac.uk
        #SBATCH --export=Non
        #SBATCH --account=grbemission
        
        module load apptainer
        
        export OMP_NUM_THREADS=$SLURM_CPUS_PER_TASK
        export LINC_DIR=/data/grbemission/shared/LINC
        export WORK_DIR=/scratch/grbemission/ah724/LOFAR_Followup/GRB200416A
        cd $WORK_DIR
        
        apptainer exec --bind /scratch:/scratch \
            $LINC_DIR/linc_latest.sif \
            cwltool \
                --outdir "/calibration_pipeline/outdir" \
                --logdir "/calibration_pipeline/logdir" \
                --preserve-entire-environment \
                --parallel \
                --no-container \
                $LINC_DIR/workflows/HBA_calibrator.cwl \
                input_calib.json

2.  Target pipeline

    The process is mostly the same. The JSON file now needs to give a list of the target files. In the submission script, `HBA_calibrator.cwl` should now be `HBA_target.cwl`.
    When you create the target JSON file, you will also need to add a line to point the pipeline to the calibration solutions, as such:
    
        {
            "msin": [
                {"class": "Directory", "path": "/path/to/data_01.MS"},
                {"class": "Directory", 'path": "/path/to/data_02.MS"},
                ...
                ],
            "cal_solutions": {"class": "File", "path": "calibration_pipeline/outdir/cal_solutions.h5"}
        }


<a id="org7fb553d"></a>

### Debugging

Include these options for debugging.

    --debug
    --tmpdir-prefix /path/to/cwd/tempdir/
    --preserve-entire-environment
    --leave-tmpdir


<a id="org95eb8a5"></a>

## POSSIBLE ISSUES

Just things that came up as potential issues for me. These may just be user error, specific problems with the datasets, or things that have since been fixed by ASTRON. Most common error will be the structure<sub>function</sub> issue.


<a id="org681e750"></a>

### Failing on download<sub>target</sub><sub>skymodel</sub>


<a id="org50e55f8"></a>

### Wrong download URL

Edit $LINCDIR/scripts/download<sub>skymodel</sub><sub>target.py</sub>
Line 120 - change URL `gsmv4` to `gsmv5`


<a id="org9841ae1"></a>

### A different wrong download URL?

Finds an error 302 on normal URL with cgi, then tries and fails on same URL but acgi.
Checking the python files I can&rsquo;t find any reference to acgi - it should just true cgi x5 then fail if this isn&rsquo;t valid but instead tries cgi then acgi 5 times.
In this case, just follow the actual URL to the page. Create file target.skymodel somewhere in the directory, and add to target.json:
`"target_skymodel": {"class": "File", "path": "/path/to/target.skymodel"}`


<a id="org2f6dfcc"></a>

### Failing on target/structure<sub>function</sub>

Usually due to flagged data making some or all bands band, or totally deleted.
To .json add `'make_structure_function': false`


<a id="orgb9cb10a"></a>

# WSClean

Software is included in the LINC Singularity container - this needs to be active to run WSClean.


<a id="orgaf20307"></a>

## Basic Imaging Command

    wsclean \
    -mgain 0.8 \           # Cleaning parameters.
    -auto-mask 10 \
    -pol I \
    -maxuv-l 8000 \
    -auto-threshold 3 \
    -weight briggs -0.5 \
    -niter 100000 \
    -weighting-rank-filter 3.0 \
    -fit-beam \
    -reorder \
    -clean-border 0 \
    -apply-primary-beam \
    -join-channels \
    -no-update-model-required \
    -name <name> \        # User parameters.
    -channels-out 6 \
    -size 2048 2048 \
    -scale 1asec \
    *.ms | tee imaging.log

Timeslicing

    -reorder --> -no-reorder
    -intervals-out X            # Split observation into X chunks.
    -interval A B               # Only use slices A to B of the whole dataset, splitting it into X chunks.


<a id="org046d023"></a>

## msoverview

`msoverview in=file.ms (verbose=T)`
View detailed information about the measurement sets. I believe this command is part of CASA, or in the Singularity container.


<a id="orgd9e1706"></a>

## Output

Produces primary beam images, dirty, model, individual beam visibilities for each outputted timeslice and per frequency channel requested.

\*-image-pb.fits are the files most interesting to us.

Example Recent Run

    wsclean \
    -mgain 0.8 \
    -auto-mask 10 \
    -pol I \
    -maxuv-l 8000 \
    -auto-threshold 3 \
    -weight-briggs -0.5 \
    -niter 100000 \
    -weighting-rank-filter 3.0 \
    -clean-border 0 \
    -fit-beam \
    -apply-primary-beam \
    -channel-division-frequencies 1.37e8,1.6e8 \
    -channels-out 1
    -reorder \
    -update-model-required \
    -name midf_wholetime_noslice \
    -size 2048 2048
    -scale 1asec \
    *.ms


<a id="org7bb6405"></a>

# Struis

Struis - Amsterdam HPC system. You&rsquo;ll need to acquire login details for this.
`ssh <username>@struis.science.uva.nl`

[Login details](login-info.md)


<a id="org47bdbaf"></a>

# TRAP

Software for analysing LOFAR data.

For Python3 - setup is easier (I&rsquo;ve saved the word to Documents somewhere but requires asking antonia for a python3 database I believe)


<a id="org4bece41"></a>

## Installation &#x2013; for tkp4.0 / python2.7 version

Clone latest version from Github.
`git clone https://github.com/transientskp/tkp.git`

Create a virtualenv if you don&rsquo;t already have one and source it. TraP 5.0 runs on Python2 still so ensure virtualenv is setup accordingly.

    virtualenv trap_env_2023 --python=python2.7
    
    
    conda activate

Install Jupyter notebook.

    pip install --upgrade pip
    pip install notebook

Install boost

    conda install -c conda-forge boost

**Changing TraP version**
Install tkp with developer mode with the &rsquo;-e&rsquo; tag, meaning we can use the Git checkout feature.

    cd ~/tkp
    pip install -e ".[pixelstore]"
    git tag             # Shows all available tags.
    git checkout r5.0   # 5.0 is the python 2.7 version I think current banana uses
