lofar-data.org
*** TODO change commands to conda create env commands

** Setting up TRAP

Ensure you're the virtual environment you setup.

#+begin_src shell
# initialise a new project (only do once?)
trap-manage.py initproject promptradio

# create a new database
creatdb -h vlo.science.uva.nl -U ahennessey <databasename>
<postgresql password>

# edit pipeline.cfg

# initialise the databse with tkp
trap-manage.py initdb
#+end_src

*** TKP PostgreSQL Login Details
~ahennessey~
~5tF69ShycX~


** Using TRAP

#+begin_src shell
# initialise the job
trap-manage.py initjob <jobname>

# edit config files
./<jobnames>/job_params.cfg # job parameters
./<jobnames>/images_to_process.py # point to image files

# run the pipeline
trap-manage.py run <jobname>

# for monitoring a position, can supply specific coordinates
trap-manage.py run [-m MONITOR_COORDS] [-l COORDS_FILE] <jobname>

# MONITOR COORDS -> a list of ra, dec coordinates in JSON format (decima degrees)
#                -> [[203.234, 120.234], [123.704, 090.234]]
# COORDS_FILE -> specify a file containing a json formatted list of coordinates as above

# output to logfile rather than terminal and track it
nohup trap-manage.py run <jobname> > trap_output.log &
tail -f trap_output.log
#end_src


* PostgreSQL

General information and commands for PostgreSQL can be found at: [[file:software.org::*PostgreSQL][software.org/postgresql]]

LOFAR specific useful commands:
#+begin_src shell
# access psql terminal
psql -U ahennessey -h vlo.science.uva.nl -d <databasename>

# export database table to csv file
\copy extractedsource TO '/scratch/ahennessey/extract_240414a.csv' CSV HEADER;
#+end_src


** Deleting databases
Access the database as above, then after using ~\dt~ to list tables, you can use ~DELETE FROM table;~ to remove each table. You will find a series of linked foreign keys, just delete the table that it's referencing from one by one until all is gone.

[[~/org/guides/software.org::* Solving foreign key issues][Foreign key issues!]]


* Banana

Used for viewing the ran files from TRAP. This doesn't automatically work for newest LINC pipelines now due to using Python 3. Instead you must manually use SQL to download as csv files and process yourself.

[[file:login-info.org::* Banana][Login details]]
