lofar-data.md


<a id="orgca511e1"></a>

### TODO change commands to conda create env commands


<a id="orga752610"></a>

## Setting up TRAP

Ensure you&rsquo;re the virtual environment you setup.

    # initialise a new project (only do once?)
    trap-manage.py initproject promptradio
    
    # create a new database
    creatdb -h vlo.science.uva.nl -U ahennessey <databasename>
    <postgresql password>
    
    # edit pipeline.cfg
    
    # initialise the databse with tkp
    trap-manage.py initdb


<a id="org484eb3a"></a>

### TKP PostgreSQL Login Details

`ahennessey`
`5tF69ShycX`


<a id="org7e8b5c7"></a>

## Using TRAP

\#+begin<sub>src</sub> shell

trap-manage.py initjob <jobname>

./<jobnames>/job<sub>params.cfg</sub> # job parameters
./<jobnames>/images<sub>to</sub><sub>process.py</sub> # point to image files

trap-manage.py run <jobname>

trap-manage.py run [-m MONITOR<sub>COORDS</sub>] [-l COORDS<sub>FILE</sub>] <jobname>

nohup trap-manage.py run <jobname> > trap<sub>output.log</sub> &
tail -f trap<sub>output.log</sub>
\#end<sub>src</sub>


<a id="orgab5f20e"></a>

# PostgreSQL

General information and commands for PostgreSQL can be found at: [software.org/postgresql](software.md)

LOFAR specific useful commands:

    # access psql terminal
    psql -U ahennessey -h vlo.science.uva.nl -d <databasename>
    
    # export database table to csv file
    \copy extractedsource TO '/scratch/ahennessey/extract_240414a.csv' CSV HEADER;


<a id="org86ed596"></a>

## Deleting databases

Access the database as above, then after using `\dt` to list tables, you can use `DELETE FROM table;` to remove each table. You will find a series of linked foreign keys, just delete the table that it&rsquo;s referencing from one by one until all is gone.

[Foreign key issues!](file:///Users/ah724/org/guides/software.md)


<a id="org817871b"></a>

# Banana

Used for viewing the ran files from TRAP. This doesn&rsquo;t automatically work for newest LINC pipelines now due to using Python 3. Instead you must manually use SQL to download as csv files and process yourself.

[Login details](login-info.md)

